import React from 'react';

const Blog = () => {
    return (
        <div>
           <h1> প্রশ্নের উত্তর</h1>
           <br></br> 
           <h3>সেমেন্টিক ট্যাক কি?</h3>
           <p> সেমান্টিক ট্যাগ বলতে আমরা যেটা বুঝি সে সমস্ত ট্যাগগুলো বুঝায় যাদের নিজেস্ব একটা অর্থ আছে।<br/> এবং যা ব্রাউজারকে সহযে একটি নির্দিষ্ট অর্থ বুঝতে সাহায্য করে।<br/> যেমন হেডার, ফুটার,এড্রেস, আর্টিকেল</p>
           <h3> ইন লাইন ব্লক ও ইন লাইন ব্লক অ্যালিমেন্টের মধ্যে পার্থক্য কি?</h3>
           <br/><br/>
           <h3>কনটেক্স এপিআই কি?</h3>
           <p> কনটেক্সট এপিআই হল একটি রিঅ্যাক্ট স্ট্রাকচার বা কাঠামো।<br/> যা আমাদেরকে অনন্য বিবরণ আদান-প্রদান করতে সক্ষমতা প্রদান করে এবং আমাদের অ্যাপ্লিকেশনের সমস্ত স্তর বা ধাপ থেকে প্রপ-ড্রিলিং সমাধানে সহায়তা করে। <br/> একটি রিঅ্যাক্ট অ্যাপের জন্য কার্যকরভাবে গ্লোবাল ভেরিয়েবল তৈরি করার একটি সুন্দর উপায় যা চারপাশে পাস করা যেতে পারে। এটি "প্রপ ড্রিলিং"।</p>
        </div>
    );
};
export default Blog;